bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32L4S9.svd
        <register>
          <name>LUT603H</name>
          <displayName>LUT603H</displayName>
          <description>Graphic MMU LUT entry 603 high</description>
          <addressOffset>0x22DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT604H</name>
          <displayName>LUT604H</displayName>
          <description>Graphic MMU LUT entry 604 high</description>
          <addressOffset>0x22E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT605H</name>
          <displayName>LUT605H</displayName>
          <description>Graphic MMU LUT entry 605 high</description>
          <addressOffset>0x22EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT606H</name>
          <displayName>LUT606H</displayName>
          <description>Graphic MMU LUT entry 606 high</description>
          <addressOffset>0x22F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT607H</name>
          <displayName>LUT607H</displayName>
          <description>Graphic MMU LUT entry 607 high</description>
          <addressOffset>0x22FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT608H</name>
          <displayName>LUT608H</displayName>
          <description>Graphic MMU LUT entry 608 high</description>
          <addressOffset>0x2304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT609H</name>
          <displayName>LUT609H</displayName>
          <description>Graphic MMU LUT entry 609 high</description>
          <addressOffset>0x230C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT610H</name>
          <displayName>LUT610H</displayName>
          <description>Graphic MMU LUT entry 610 high</description>
          <addressOffset>0x2314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT611H</name>
          <displayName>LUT611H</displayName>
          <description>Graphic MMU LUT entry 611 high</description>
          <addressOffset>0x231C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT612H</name>
          <displayName>LUT612H</displayName>
          <description>Graphic MMU LUT entry 612 high</description>
          <addressOffset>0x2324</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT613H</name>
          <displayName>LUT613H</displayName>
          <description>Graphic MMU LUT entry 613 high</description>
          <addressOffset>0x232C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT614H</name>
          <displayName>LUT614H</displayName>
          <description>Graphic MMU LUT entry 614 high</description>
          <addressOffset>0x2334</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT615H</name>
          <displayName>LUT615H</displayName>
          <description>Graphic MMU LUT entry 615 high</description>
          <addressOffset>0x233C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT616H</name>
          <displayName>LUT616H</displayName>
          <description>Graphic MMU LUT entry 616 high</description>
          <addressOffset>0x2344</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT617H</name>
          <displayName>LUT617H</displayName>
          <description>Graphic MMU LUT entry 617 high</description>
          <addressOffset>0x234C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT618H</name>
          <displayName>LUT618H</displayName>
          <description>Graphic MMU LUT entry 618 high</description>
          <addressOffset>0x2354</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT619H</name>
          <displayName>LUT619H</displayName>
          <description>Graphic MMU LUT entry 619 high</description>
          <addressOffset>0x235C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT620H</name>
          <displayName>LUT620H</displayName>
          <description>Graphic MMU LUT entry 620 high</description>
          <addressOffset>0x2364</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT621H</name>
          <displayName>LUT621H</displayName>
          <description>Graphic MMU LUT entry 621 high</description>
          <addressOffset>0x236C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT622H</name>
          <displayName>LUT622H</displayName>
          <description>Graphic MMU LUT entry 622 high</description>
          <addressOffset>0x2374</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT623H</name>
          <displayName>LUT623H</displayName>
          <description>Graphic MMU LUT entry 623 high</description>
          <addressOffset>0x237C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT624H</name>
          <displayName>LUT624H</displayName>
          <description>Graphic MMU LUT entry 624 high</description>
          <addressOffset>0x2384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT625H</name>
          <displayName>LUT625H</displayName>
          <description>Graphic MMU LUT entry 625 high</description>
          <addressOffset>0x238C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT626H</name>
          <displayName>LUT626H</displayName>
          <description>Graphic MMU LUT entry 626 high</description>
          <addressOffset>0x2394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT627H</name>
          <displayName>LUT627H</displayName>
          <description>Graphic MMU LUT entry 627 high</description>
          <addressOffset>0x239C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT628H</name>
          <displayName>LUT628H</displayName>
          <description>Graphic MMU LUT entry 628 high</description>
          <addressOffset>0x23A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT629H</name>
          <displayName>LUT629H</displayName>
          <description>Graphic MMU LUT entry 629 high</description>
          <addressOffset>0x23AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT630H</name>
          <displayName>LUT630H</displayName>
          <description>Graphic MMU LUT entry 630 high</description>
          <addressOffset>0x23B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT631H</name>
          <displayName>LUT631H</displayName>
          <description>Graphic MMU LUT entry 631 high</description>
          <addressOffset>0x23BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT632H</name>
          <displayName>LUT632H</displayName>
          <description>Graphic MMU LUT entry 632 high</description>
          <addressOffset>0x23C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT633H</name>
          <displayName>LUT633H</displayName>
          <description>Graphic MMU LUT entry 633 high</description>
          <addressOffset>0x23CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT634H</name>
          <displayName>LUT634H</displayName>
          <description>Graphic MMU LUT entry 634 high</description>
          <addressOffset>0x23D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT635H</name>
          <displayName>LUT635H</displayName>
          <description>Graphic MMU LUT entry 635 high</description>
          <addressOffset>0x23DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT636H</name>
          <displayName>LUT636H</displayName>
          <description>Graphic MMU LUT entry 636 high</description>
          <addressOffset>0x23E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT637H</name>
          <displayName>LUT637H</displayName>
          <description>Graphic MMU LUT entry 637 high</description>
          <addressOffset>0x23EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT638H</name>
          <displayName>LUT638H</displayName>
          <description>Graphic MMU LUT entry 638 high</description>
          <addressOffset>0x23F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT639H</name>
          <displayName>LUT639H</displayName>
          <description>Graphic MMU LUT entry 639 high</description>
          <addressOffset>0x23FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT640H</name>
          <displayName>LUT640H</displayName>
          <description>Graphic MMU LUT entry 640 high</description>
          <addressOffset>0x2404</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT641H</name>
          <displayName>LUT641H</displayName>
          <description>Graphic MMU LUT entry 641 high</description>
          <addressOffset>0x240C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT642H</name>
          <displayName>LUT642H</displayName>
          <description>Graphic MMU LUT entry 642 high</description>
          <addressOffset>0x2414</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT643H</name>
          <displayName>LUT643H</displayName>
          <description>Graphic MMU LUT entry 643 high</description>
          <addressOffset>0x241C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LO</name>
              <description>Line offset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
